// 1. 匹配中文
// 2. 去除空格
// 3. 识别手机号
// 4. 识别邮箱
// 5. 识别ip
// 6. 识别身份证


// 1. 匹配中文
// 匹配中文字符的正则表达式： [\u4e00-\u9fa5]
console.log("------------------1. 匹配中文------------------");
var regex1 = /[\u4e00-\u9fa5]/ ;
console.log(regex1.test("我"));
console.log(regex1.test("me"));

// 2. 去除空格
console.log("------------------2. 去除空格------------------");
var string2 = "  I love you   ";
// 匹配开头空格
console.log(string2.replace(/^\s*/,""));
// 匹配结尾空格
console.log(string2.replace(/\s*$/,""));
// 匹配开头结尾空格
console.log(string2.replace(/^\s*|\s*$/g,""));
// 匹配所有空格
console.log(string2.replace(/\s/g,""));

// 3. 识别手机号
// 手机号也在不断更新，如果要精确需要跟进更新
console.log("------------------3. 识别手机号------------------");
var regex3 = /^1[34578][0-9]{9}$/ ;
console.log(regex3.test("15666798678"));
console.log(regex3.test("11666798678"));

// 4. 识别邮箱
//                          hello.nihao@qq.com.cn
// 任意字母数字下划线  .任意字母数字下划线    @   字母数字         .字母{2,5}位 .字母{2,5}
// 		\w{3,}	    (\.\w+)*		   @   [A-z0-9]+  	    (\.[A-z]{2,5}){1,2}
//                                                          后面的可以出现一到两次
console.log("------------------4. 识别邮箱------------------");
var regex4 = /\w{3,}(\.\w+)*@[A-z0-9]+(\.[A-z]{2,5}){1,2}/ ;
console.log(regex4.test("shadowplusing@qq.com"));
console.log(regex4.test("shadowplusing@outlook.com"));
console.log(regex4.test("shadowplusing@gmail.com"));

// 5. 识别ip
// IP地址的长度为32位(共有2^32个IP地址)，分为4段，每段8位
// 用十进制数字表示，每段数字范围为0～255，段与段之间用句点隔开。
// 0.0.0.0 ～ 255.255.255.255
// 根据规则：每段相同，范围都在 0 ~ 255
// 0~255 对应的正则表达式为 [0-1]?\d{1,2}|(2(5[0-5]|[0-4]\d))
// [0-1]?\d{1,2} 匹配：0 ~ 199
// 2(5[0-5]|[0-4]\d) 匹配：200 ~ 255
var regex5 = /^(([0-1]?\d{1,2})|(25[0-5]|[0-4]\d))(\.([0-1]?\d{1,2})|(25[0-5]|[0-4]\d)){3}$/ ;
console.log("------------------5. 识别ip------------------");
console.log(regex5.test("0.0.0.0"));
console.log(regex5.test("127.0.0.1"));

// 6. 识别身份证
// 出生日期1800-2099 (18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])
// 身份证正则表达式 /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|[xX])$/
// 位校验规则 6位地址编码+8位出生日期+3位顺序号+1位校验位
var regex6 = /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|[xX])$/ ;
console.log("------------------6. 识别身份证------------------");
console.log(regex6.test("440582209911117235"));